docs: updated use cases to plantuml
